Revit 2027 API
PrintManager.PrintToFileName Property
 The file name when printing to file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PrintToFileName { get; set; }
Public Property PrintToFileName As String
	Get
	Set
public:
property String^ PrintToFileName {
	String^ get ();
	void set (String^ value);
}
member PrintToFileName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input file name is null.
ArgumentException |  Thrown when the input file name is an invalid string.
Remarks
A default file name will be used when the PrintToFile is true and PrintToFileName is not be set.
 The value of this property represents the global print setting property used for print operations on any document. In order to make a change to this property, after setting it call the Apply() method, or one of the SubmitPrint() methods, which save the local changes as modifications to the global print settings.
See Also
Reference
PrintManager Class
Autodesk.Revit.DB Namespace